### [그룹화 처리]
- 주제 : 타이타닉에서 선실에 등급에 따른 생존 비율을 분석

In [60]:
import pandas as pd

In [61]:
file_name = "titanic.csv"

In [62]:
data = pd.read_csv(file_name)
data

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,0,2,male,27.0,0,0,13.0000,S,Second,man,True,NaN,Southampton,no,True
887,1,1,female,19.0,0,0,30.0000,S,First,woman,False,B,Southampton,yes,True
888,0,3,female,NaN,1,2,23.4500,S,Third,woman,False,NaN,Southampton,no,False
889,1,1,male,26.0,0,0,30.0000,C,First,man,True,C,Cherbourg,yes,True
890,0,3,male,32.0,0,0,7.7500,Q,Third,man,True,NaN,Queenstown,no,True

In [63]:
data.isna().sum()

survived         0
pclass           0
sex              0
age            177
sibsp            0
parch            0
fare             0
embarked         2
class            0
who              0
adult_male       0
deck           688
embark_town      2
alive            0
alone            0
dtype: int64

In [64]:
data.duplicated().sum()

np.int64(107)

In [65]:
data = data.drop_duplicates()

In [66]:
data.duplicated().sum()

np.int64(0)

In [67]:
data2 = data[["pclass", "survived"]]
data2

     pclass  survived
0         3         0
1         1         1
2         3         1
3         1         1
4         3         0
..      ...       ...
885       3         0
887       1         1
888       3         0
889       1         1
890       3         0

[784 rows x 2 columns]

In [68]:
group_data = data2.groupby("pclass")
pd.DataFrame(group_data)

   0                                                  1
0  1       pclass  survived
1         1         1
3 ...
1  2       pclass  survived
9         2         1
15...
2  3       pclass  survived
0         3         0
2 ...

In [69]:
print(group_data.groups.keys())
print(group_data.groups.values())

dict_keys([1, 2, 3])
dict_values([Index([  1,   3,   6,  11,  23,  27,  30,  31,  34,  35,
       ...
       853, 856, 857, 862, 867, 871, 872, 879, 887, 889],
      dtype='int64', length=214), Index([  9,  15,  17,  20,  21,  33,  41,  43,  53,  56,
       ...
       841, 848, 854, 861, 864, 865, 866, 874, 880, 883],
      dtype='int64', length=165), Index([  0,   2,   4,   5,   7,   8,  10,  12,  13,  14,
       ...
       868, 869, 873, 875, 876, 881, 882, 885, 888, 890],
      dtype='int64', length=405)])

In [70]:
group_data.sum()

        survived
pclass
1            135
2             84
3            104

In [71]:
class_1 = round(int(group_data.sum().loc[1]) / len(data) * 100, 2)
class_2 = round(int(group_data.sum().loc[2]) / len(data) * 100, 2)
class_3 = round(int(group_data.sum().loc[3]) / len(data) * 100, 2)

C:\Users\KDP-2\AppData\Local\Temp\ipykernel_12484\1732551091.py:1: FutureWarning: Calling int on a single element Series is deprecated and will raise a TypeError in the future. Use int(ser.iloc[0]) instead
  class_1 = round(int(group_data.sum().loc[1]) / len(data) * 100, 2)
C:\Users\KDP-2\AppData\Local\Temp\ipykernel_12484\1732551091.py:2: FutureWarning: Calling int on a single element Series is deprecated and will raise a TypeError in the future. Use int(ser.iloc[0]) instead
  class_2 = round(int(group_data.sum().loc[2]) / len(data) * 100, 2)
C:\Users\KDP-2\AppData\Local\Temp\ipykernel_12484\1732551091.py:3: FutureWarning: Calling int on a single element Series is deprecated and will raise a TypeError in the future. Use int(ser.iloc[0]) instead
  class_3 = round(int(group_data.sum().loc[3]) / len(data) * 100, 2)

In [72]:
print(class_1)
print(class_2)
print(class_3)

17.22
10.71
13.27

In [73]:
list = [class_1, class_2, class_3]
list

pd.DataFrame(data = list, index = [''])

ValueError: Shape of passed values is (3, 1), indices imply (1, 1)